-- MySQL dump 10.13  Distrib 5.7.17, for Win64 (x86_64)
--
-- Host: localhost    Database: findjob
-- ------------------------------------------------------
-- Server version	5.7.17-log

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `sub_activity_of_advertisement`
--

DROP TABLE IF EXISTS `sub_activity_of_advertisement`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `sub_activity_of_advertisement` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `sub_name` varchar(100) DEFAULT NULL,
  `parent_activity_of_advertisement` int(11) DEFAULT NULL,
  PRIMARY KEY (`id`),
  KEY `parent_activity_of_advertisement` (`parent_activity_of_advertisement`),
  CONSTRAINT `sub_activity_of_advertisement_ibfk_1` FOREIGN KEY (`parent_activity_of_advertisement`) REFERENCES `activity_of_advertisement` (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=125 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `sub_activity_of_advertisement`
--

LOCK TABLES `sub_activity_of_advertisement` WRITE;
/*!40000 ALTER TABLE `sub_activity_of_advertisement` DISABLE KEYS */;
INSERT INTO `sub_activity_of_advertisement` VALUES (1,'Автослесарь',1),(2,'Сервисное обслуживание',1),(3,'Автозапчасти',1),(4,'Продажа',1),(5,'Автомойщик',1),(6,'Шины, диски',1),(7,'Автопроизводство',1),(8,'Прокат',1),(9,'Бухгалтер',2),(10,'Первичная документация',2),(11,'Учет счетов и платежей',2),(12,'Экономист',2),(13,'Кассир, инкассатор',2),(14,'Налоги',2),(15,'Финансовый анализ и контроль',2),(16,'Финансовый менеджмент',2),(17,'Программирование и разработка',3),(18,'Инженер',3),(19,'Web инженер',3),(20,'Управление проектами',3),(21,'Маркетинг',3),(22,'Тестирование',3),(23,'Системный администратор',3),(24,'Продажи',3),(25,'Игровое ПО',3),(26,'Аналитик',3),(27,'Компьютерная безопасность',3),(28,'Дизайн, графика, живопись',4),(29,'Фотография',4),(30,'Журналистика',4),(31,'Казино, игорный бизнес',4),(32,'Издательская деятельность',4),(33,'Мода',4),(34,'Телевидение',4),(35,'Кино',4),(36,'Музыка',4),(37,'Радио',4),(42,'Младший и средний мед персонал',6),(43,'Продажи',6),(44,'Лечащий врач',6),(45,'Лекарственный препараты',6),(46,'Ветеринария',6),(47,'Фармацевт',6),(48,'Медицинское оборудование',6),(49,'Маркетинг',6),(50,'Лаборант',6),(52,'PR, маркетинговые коммуникации',5),(53,'Менеджер по работе с клиентами',5),(54,'Интернет-маркетинг',5),(55,'Планирование, размещение рекламы',5),(56,'Дизайнер',5),(57,'Управление маркетингом',5),(58,'Печатная реклама',5),(59,'Копирайтер',5),(60,'Аналитик',5),(61,'Мерчендайзинг',5),(63,'Преподавание',7),(64,'Гумманитарные науки',7),(65,'Математика',7),(66,'Физика',7),(67,'Химия',7),(68,'Инофрмационные системы',7),(69,'Экономика, менеджмент',7),(70,'Биотехнологии',7),(71,'Рабочие строительных специальностей',8),(72,'Инженер',8),(73,'Проектирование',8),(74,'Эксплуатация',8),(75,'Управление проектами',8),(76,'Прораб',8),(77,'Жильё',8),(78,'Нежилые помещения',8),(79,'Отопление, вентиляция, канализация',8),(80,'Агент',8),(81,'ЖКХ',8),(82,'Дизайн',8),(84,'Агент',9),(85,'Автострахование',9),(86,'Страхование физических лиц',9),(87,'Страхование юридических лиц',9),(88,'Медицинское страхование',9),(89,'Страхование недвижимости',9),(90,'Водитель',10),(91,'Автоперевозки',10),(92,'Логистика',10),(93,'Экспедитор',10),(94,'Кладовщик',10),(95,'Диспетчер',10),(97,'Железнодорожные перевозки',10),(98,'Контейнерные перевозки',10),(99,'Авиаперевозки',10),(100,'Закупки, снабжение',10),(101,'Таможенное оформление',10),(102,'Водные перевозки',10),(104,'Повар',11),(105,'Официант, бармен',11),(106,'Персонал кухни',11),(107,'Продажа туристических услуг',11),(108,'Организация туристических продуктов',11),(109,'Управление ресторанами, барами',11),(110,'Персонал отеля',11),(111,'Оформление виз',11),(112,'Гид, экскурсовод',11),(113,'Юридический консультант',13),(114,'Договорное право',13),(115,'Трудовое право',13),(116,'Корпоративное право',13),(117,'Ценные бумаги',13),(118,'Регистрация юридических лиц',13),(119,'Недвижимость',13),(120,'Адвокат',13),(121,'Международное право',13);
/*!40000 ALTER TABLE `sub_activity_of_advertisement` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2018-06-23  2:38:03
